sebailfico/sono-loco/esp32-code/src/main.cpp
// TX counters — incremented from callbacks, reported from loop(). Never log
// from the send callback itself: it fires ~220x/s and a blocking Serial write
// at that rate causes the very dropouts it would be reporting.
static volatile uint32_t txQueueFull  = 0;
static volatile uint32_t txSendErr    = 0;
static volatile uint32_t txRadioFail  = 0;

// --- RX (CLIENT mode) ---
// The ring buffer and the packet sequence accounting live in lib/jitter: they
// are pure logic, they are where the nastiest bugs in this project came from,
// and there they can be tested on this PC instead of only on a board. What
// stays here is the part that genuinely needs a radio and an I2S peripheral.
static_assert((JITTER_BUF_SIZE & (JITTER_BUF_SIZE - 1)) == 0,
              "JITTER_BUF_SIZE must be a power of two");

static uint8_t      jStorage[JITTER_BUF_SIZE];
static JitterBuffer jbuf;
static SeqTracker   seqTracker(SEQ_RESYNC_THRESHOLD, MAX_GAP_FILL_PKTS);

static volatile bool jReady   = false;   // true once prefill threshold is met
static volatile bool rxActive = false;   // set by recv callback, triggers mode switch
static volatile unsigned long lastRxMs = 0;
static volatile uint32_t rxCount    = 0;
static volatile uint32_t rxOverflow = 0;   // packets dropped, jitter buffer full
static volatile uint32_t rxUnderrun = 0;   // times playback outran the buffer
// lost / dupe / resync counters live on seqTracker.

// Lock onto the first node we hear so two simultaneous servers can never
// interleave their streams into one jitter buffer.
static uint8_t          lockedSender[6] = {0};
static volatile bool    senderLocked    = false;

static void espnowTxTask(void *) {
    AudioPacket pkt;
    while (true) {
        if (xQueueReceive(txQueue, &pkt, portMAX_DELAY) != pdTRUE) continue;

        // Wait for the previous frame to actually leave the radio. Firing
        // esp_now_send() back-to-back at ~220 pkt/s returns
        // ESP_ERR_ESPNOW_NO_MEM and drops audio without any indication.
        xSemaphoreTake(txDone, pdMS_TO_TICKS(50));

        esp_err_t err = esp_now_send(BROADCAST_ADDR, (uint8_t *)&pkt,
                                     ESPNOW_HEADER_SIZE + pkt.len);
        if (err != ESP_OK) {
            txSendErr++;
            xSemaphoreGive(txDone);   // no callback will come; release the gate
        }
    }
}

static void onEspNowSent(const uint8_t *, esp_now_send_status_t status) {
    if (status != ESP_NOW_SEND_SUCCESS) txRadioFail++;
    if (txDone) xSemaphoreGive(txDone);
}

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
static void onEspNowRecv(const esp_now_recv_info_t *info, const uint8_t *data, int len) {
    const uint8_t *srcMac = info->src_addr;
#else
static void onEspNowRecv(const uint8_t *srcMac, const uint8_t *data, int len) {
#endif
    if (len < ESPNOW_HEADER_SIZE) return;

    // A SERVER is the source, not a listener. Bailing before the lock below
    // matters: locking here would pin lockedSender to whatever stray node we
    // happened to hear while serving, and that lock outlives SERVER mode.
    if (currentMode == MODE_SERVER) return;

    if (!senderLocked) {
        memcpy(lockedSender, srcMac, 6);
        senderLocked = true;
    } else if (memcmp(lockedSender, srcMac, 6) != 0) {
        return;   // a second server is broadcasting — ignore it
    }

    // The received buffer has no alignment guarantee; copy the header out
    // instead of casting to a struct pointer.
    uint16_t seq, plen;
    memcpy(&seq,  data,     2);
    memcpy(&plen, data + 2, 2);

    // Trust the wire for nothing: clamp to what was actually received, to our
    // own payload limit, and to an even byte count so 16-bit framing survives.
    int n = (int)plen;
    int avail = len - ESPNOW_HEADER_SIZE;
    if (n > avail)                n = avail;
    if (n > ESPNOW_PAYLOAD_SIZE)  n = ESPNOW_PAYLOAD_SIZE;
    n &= ~1;
    if (n <= 0) return;

    lastRxMs = millis();
    rxCount++;

    if (currentMode == MODE_DISCOVERY) {
        rxActive = true;   // signal main loop to switch to CLIENT
        return;
    }

    if (currentMode != MODE_CLIENT) return;

    // Duplicate / reordered / restarted-server handling, including the unsigned
    // 65535-gap trap, is in SeqTracker and covered by the host tests.
    const SeqResult sr = seqTracker.update(seq);
    if (!sr.accept) return;   // exact retransmit — replaying it is an audible stutter

    // Substitute silence for lost packets so playback keeps its timing instead
    // of splicing the stream shorter on every loss.
    if (sr.fillPackets > 0 &&
        !jbuf.pushSilence(sr.fillPackets * ESPNOW_PAYLOAD_SIZE)) {
        rxOverflow++;
    }

    if (!jbuf.pushBlock(data + ESPNOW_HEADER_SIZE, n)) rxOverflow++;
}

static bool espnowActive = false;

static void setupESPNow() {
    // BT Classic + WiFi simultaneously requires PSRAM on ESP32.
    // Without PSRAM, WiFi takes ~80KB of the only ~215KB available DRAM heap,
    // leaving the BT stack unable to allocate L2CAP/AVDTP buffers → crash.
    //
    // Guard: only init WiFi if PSRAM is present OR BT is not compiled in.
    // - WROOM (no PSRAM, BT enabled)  → skip WiFi; acts as BT speaker only
    // - S3    (PSRAM,  BT disabled)   → init WiFi; acts as ESP-NOW client
    // - WROVER (PSRAM, BT enabled)    → init WiFi; fully interchangeable
#ifdef ENABLE_BLUETOOTH
    if (ESP.getPsramSize() == 0) {
        LOG_WARN("No PSRAM detected — WiFi/ESP-NOW disabled to protect BT heap.");
        LOG_WARN("This node will play locally only (no mesh). Upgrade to WROVER for full mesh.");
        return;
    }
#endif

    // esp_wifi_init() needs the netif layer and a default event loop in place.
    // Both are no-ops (ESP_ERR_INVALID_STATE) if Arduino already set them up.
    esp_netif_init();
    esp_event_loop_create_default();

    // RX stays at the IDF default. It was trimmed to 4 on the theory that "PSRAM
    // handles the rest" — it does not: WiFi static RX buffers are DMA-capable
    // internal DRAM and cannot live in PSRAM. All that trim bought was a receiver
    // four packets deep against a continuous ~220 pkt/s stream, i.e. unexplained
    // `lost` counts. TX is safe to trim because the send semaphore keeps exactly
    // one frame in flight.
    wifi_init_config_t wcfg = WIFI_INIT_CONFIG_DEFAULT();
    wcfg.static_rx_buf_num  = WIFI_STATIC_RX_BUFFERS;
    wcfg.dynamic_tx_buf_num = WIFI_DYNAMIC_TX_BUFFERS;

    esp_err_t ret = esp_wifi_init(&wcfg);
    if (ret != ESP_OK) {
        LOG_ERROR("WiFi init failed: " + String(esp_err_to_name(ret)));
        return;
    }
    esp_wifi_set_mode(WIFI_MODE_STA);
    esp_wifi_set_storage(WIFI_STORAGE_RAM);
    esp_wifi_start();

    // Modem sleep parks the radio between beacons and makes ESP-NOW reception
    // miss packets. A continuous audio stream needs the receiver always on.
    esp_wifi_set_ps(WIFI_PS_NONE);

    // Fixed channel — must match on all nodes
    esp_wifi_set_channel(ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);
    LOG_INFO("Heap after WiFi init: " + String(ESP.getFreeHeap()) + " bytes");

